# Script to make some example data that has a few missing values that need to be imputed in some non standard way

### Import libraries

In [1]:
import pandas as pd
import numpy as np

### Constants

In [26]:
N = 100  # Total number of datapoints
MAX_ENGINES = 5  # Boats have engines. Longer boats have more engines. More boats = more engines
MIN_ENGINES = 0
MAX_LENGTH = 60  # Length of a boat
MIN_LENGTH = 0
CLASS_RANGE = 5  # Number of distinct boat classes (e.g. fishing, personal water craft, pontoon etc. Use letters as proxy)
BOAT_CLASSES = list(map(chr, np.arange(65, 65+CLASS_RANGE)))

### DataFrame

In [70]:
df = pd.DataFrame({'boatClass': np.random.choice(BOAT_CLASSES, N)
                 , 'boatLength': np.random.randint(MIN_LENGTH, MAX_LENGTH, N)
                 , 'boatEngines': np.random.randint(MIN_ENGINES, MAX_ENGINES, N)})
df

   boatClass  boatLength  boatEngines
0          C           8            1
1          D          35            1
2          E          13            3
3          C          28            1
4          E          51            0
..       ...         ...          ...
95         C          17            4
96         B          49            2
97         E          55            2
98         E          12            4
99         C           6            2

[100 rows x 3 columns]

### Missing values

In [71]:
na_frac = 0.2  # Fraction of missing values
idx = df.index.to_list()
np.random.shuffle(idx)


df.iloc[idx[:int(N*na_frac)], 2] = np.nan
df

   boatClass  boatLength  boatEngines
0          C           8          NaN
1          D          35          1.0
2          E          13          3.0
3          C          28          1.0
4          E          51          0.0
..       ...         ...          ...
95         C          17          4.0
96         B          49          2.0
97         E          55          2.0
98         E          12          4.0
99         C           6          2.0

[100 rows x 3 columns]

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   boatClass    100 non-null    object
 1   boatLength   100 non-null    int32
 2   boatEngines  80 non-null     float64
dtypes: float64(1), int32(1), object(1)
memory usage: 2.1+ KB